from dotenv import dotenv_values

config = dotenv_values(".env")

API_ID = int(config["API_ID"])
API_HASH = config["API_HASH"]
BOT_TOKEN = config["BOT_TOKEN"]

KEYWORDS = {
    "LOST": [
        "потерять",
        "потерял",
        "потеряла",
        "потеряло",
        "потеряли",
        "потерянный",
        "потерянная",
        "потерянное",
        "потерянные",
        "потерянного",
        "потерянной",
        "потерянного",
        "потерянных",
        "потерянному",
        "потерянной",
        "потерянному",
        "потерянным",
        "потерянный",
        "потерянную",
        "потерянное",
        "потерянные",
        "потерянного",
        "потерянную",
        "потерянное",
        "потерянных",
        "потерянным",
        "потерянной",
        "потерянною",
        "потерянным",
        "потерянными",
        "потерянном",
        "потерянной",
        "потерянном",
        "потерянных",
        "потерян",
        "потеряна",
        "потеряно",
        "потеряны"
    ],
    "FOUND": [
        "нашёл",
        "нашла"
        "нашло",
        "нашли",
        "найден,",
        "найдена,",
        "найдено,",
        "найдены"
    ]
}

targets = [
    "LostFoundK",
    "kriminalunet",
    "poteryal_azn"
]